app/Controllers/UserController.php

    public function index()
    {
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function store()
    {
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone')
        ];

        $this->userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`, `phone`) VALUES ('Jamm', 'JAM@gmail.com', '617283')

    public function delete($id)
    {
        $this->userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('11')